import pytest
from numpy import nan


@pytest.fixture()
def test_dataframe_as_list() -> list[list]:
    """тестовая фикстура датафрейма в виде списка списков значений в ячейках"""

    return [
        ["2024-12-30", "2024-12-30", "*7197", "OK", -1, "RUB", -1, "RUB", 1, "Супермаркеты", 5411, "Колхоз"],
        ["2024-12-23", "2024-12-23", "*7197", "OK", -1000, "RUB", -1000, "RUB", 1, "Супермаркеты", 5411, "Колхоз"],
        ["2024-12-24", "2024-12-24", "*7197", "OK", -1000, "RUB", -1000, "RUB", 1, "Супермаркеты", 5411, "Колхоз"],
        ["2024-12-25", "2024-12-25", "*7197", "OK", -1000, "RUB", -1000, "RUB", 1, "Супермаркеты", 5411, "Магнит"],
        ["2024-12-26", "2024-12-26", "*7197", "OK", -1000, "RUB", -1000, "RUB", 1, "Супермаркеты", 5411, "Колхоз"],
        [
            "2024-12-27",
            "2024-12-27",
            "*5091",
            "OK",
            -1000,
            "RUB",
            -1000,
            "RUB",
            1,
            "Различные товары",
            5399,
            "Ozon.ru",
        ],
        ["2024-12-28", "2024-12-28", nan, "OK", -500, "RUB", -500, "RUB", 1, "Переводы", 0, "Константин Л."],
        ["2024-12-29", "2024-12-29", nan, "OK", -500, "RUB", -500, "RUB", 1, "Переводы", 0, "Константин Л."],
        ["2024-09-28", "2024-09-28", nan, "OK", -1.00, "RUB", -1.00, "RUB", 1, "Переводы", 0, "Константин Л."],
    ]


@pytest.fixture()
def test_dataframe_as_list2() -> list[list]:
    """тестовая фикстура датафрейма в виде списка списков значений в ячейках"""

    return [
        ["2024-12-30", "2024-12-30", "*7197", "OK", -1, "RUB", -1, "RUB", 1, "Супермаркеты", 5411, "Колхоз"],
        ["2024-12-30", "2024-12-30", "*7197", "OK", 1, "RUB", 1, "RUB", 1, "Переводы", 5411, "Колхоз"],
        ["2024-12-23", "2024-12-23", "*7197", "OK", -1000, "RUB", -1000, "RUB", 1, "Супермаркеты", 5411, "Колхоз"],
        ["2024-12-23", "2024-12-23", "*7197", "OK", 100, "RUB", 100, "RUB", 1, "Переводы", 5411, "Колхоз"],
        ["2024-12-24", "2024-12-24", "*7197", "OK", -1000, "RUB", -1000, "RUB", 1, "Супермаркеты", 5411, "Колхоз"],
        ["2024-12-24", "2024-12-24", "*7197", "OK", 100, "RUB", 100, "RUB", 1, "Переводы", 5411, "Колхоз"],
        ["2024-12-25", "2024-12-25", "*7197", "OK", -1000, "RUB", -1000, "RUB", 1, "Супермаркеты", 5411, "Магнит"],
        ["2024-12-25", "2024-12-25", "*7197", "OK", 100, "RUB", 100, "RUB", 1, "Переводы", 5411, "Магнит"],
        ["2024-12-26", "2024-12-26", "*7197", "OK", -1000, "RUB", -1000, "RUB", 1, "Супермаркеты", 5411, "Колхоз"],
        ["2024-12-26", "2024-12-26", "*7197", "OK", 100, "RUB", 100, "RUB", 1, "Переводы", 5411, "Колхоз"],
        [
            "2024-12-27",
            "2024-12-27",
            "*5091",
            "OK",
            -1000,
            "RUB",
            -1000,
            "RUB",
            1,
            "Различные товары",
            5399,
            "Ozon.ru",
        ],
        ["2024-12-27", "2024-12-27", "*5091", "OK", 100, "RUB", 100, "RUB", 1, "Переводы", 5399, "Ozon.ru"],
        ["2024-12-28", "2024-12-28", nan, "OK", -500, "RUB", -500, "RUB", 1, "Переводы", 0, "Константин Л."],
        ["2024-12-28", "2024-12-28", nan, "OK", 50, "RUB", 50, "RUB", 1, "Переводы", 0, "Константин Л."],
        ["2024-12-29", "2024-12-29", nan, "OK", -500, "RUB", -500, "RUB", 1, "Переводы", 0, "Константин Л."],
        ["2024-12-29", "2024-12-29", nan, "OK", 50, "RUB", 50, "RUB", 1, "Переводы", 0, "Константин Л."],
        ["2024-09-28", "2024-09-28", nan, "OK", -1, "RUB", -1, "RUB", 1, "Переводы", 0, "Константин Л."],
        ["2024-09-28", "2024-09-28", nan, "OK", 1, "RUB", -1, "RUB", 1, "Переводы", 0, "Константин Л."],
    ]


@pytest.fixture()
def test_dataframe_as_list3() -> list[list]:
    """тестовая фикстура датафрейма в виде списка списков значений в ячейках"""

    return [
        ["2024-12-30", "2024-12-30", "*7197", "OK", -1, "RUB", -1, "RUB", 1, "Категория_1", 5411, "Колхоз"],
        ["2024-12-23", "2024-12-23", "*7197", "OK", -2, "RUB", -2, "RUB", 1, "Категория_2", 5411, "Колхоз"],
        ["2024-12-24", "2024-12-24", "*7197", "OK", -3, "RUB", -3, "RUB", 1, "Категория_3", 5411, "Колхоз"],
        ["2024-12-25", "2024-12-25", "*7197", "OK", -4, "RUB", -4, "RUB", 1, "Категория_4", 5411, "Колхоз"],
        ["2024-12-26", "2024-12-26", "*7197", "OK", -5, "RUB", -5, "RUB", 1, "Категория_5", 5411, "Колхоз"],
        ["2024-12-27", "2024-12-27", "*5091", "OK", -6, "RUB", -6, "RUB", 1, "Категория_6", 5399, "Колхоз"],
    ]


@pytest.fixture()
def example_user_stocks_fixture() -> dict:
    """Фикстура акций для пользователя"""
    return {"user_stocks": ["AAPL", "AMZN", "GOOGL", "MSFT", "TSLA"]}


@pytest.fixture()
def example_user_currencies_fixture() -> dict:
    """Фикстура валют для пользователя"""
    return {"user_currencies": ["USD", "EUR", "CNY"]}
